# Cargar datos a los DataFrames

In [4]:
import pandas as pd
import numpy as np
from time import perf_counter

In [15]:
ventas = pd.read_csv('../files/datos/ventas.csv', sep=',', encoding='utf8', index_col=0)

In [16]:
ventas

                Trimestre 1  Trimestre 2  Trimestre 3  Trimestre 4
Sucursal Norte         1001         1002         1003         1004
Sucursal Este          2001         2002         2003         2004
Sucursal Oeste         3001         3002         3003         3004
Sucursal Sur           4001         4002         4003         4004

In [24]:
ventas = pd.read_csv('../files/datos/ventas_con_simbolo.csv', 
                     index_col=0, sep='$', encoding='utf8', usecols=[0,1,4], nrows=3)

In [25]:
ventas

                Trimestre 1  Trimestre 4
Sucursal Norte         1001         1004
Sucursal Este          2001         2004
Sucursal Oeste         3001         3004

In [31]:
ventas = pd.read_csv('../files/datos/ventas_sin_encabezado.csv',
                    index_col=0, sep=',', header=None,encoding='utf8', 
                     names=['t1', 't2', 't3', 't4'])

In [32]:
ventas

                  t1    t2    t3    t4
Sucursal Norte  1001  1002  1003  1004
Sucursal Este   2001  2002  2003  2004
Sucursal Oeste  3001  3002  3003  3004
Sucursal Sur    4001  4002  4003  4004

In [41]:
ventas = pd.read_csv('../files/datos/ventas_con_basura.csv', sep=',', encoding='utf8',
                    index_col=0, skiprows=1, skipfooter=1, engine='python')

In [42]:
ventas

                Trimestre 1  Trimestre 2  Trimestre 3  Trimestre 4
Sucursal Norte         1001         1002         1003         1004
Sucursal Este          2001         2002         2003         2004
Sucursal Oeste         3001         3002         3003         3004
Sucursal Sur           4001         4002         4003         4004

In [50]:
ventas = pd.read_excel('../files/datos/ventas_anuales.xlsx', index_col=0, skiprows=1,
                      sheet_name=None)

In [51]:
ventas

{'2020':                 Trimestre 1  Trimestre 2  Trimestre 3  Trimestre 4
 Sucursal Norte         1001         1002         1003         1004
 Sucursal Este          2001         2002         2003         2004
 Sucursal Oeste         3001         3002         3003         3004
 Sucursal Sur           4001         4002         4003         4004,
 '2021':                 Trimestre 1  Trimestre 2  Trimestre 3  Trimestre 4
 Sucursal Norte         2001         2002         2003         2004
 Sucursal Este          4001         4002         4003         4004
 Sucursal Oeste         6001         6002         6003         6004
 Sucursal Sur           8001         8002         8003         8004}

In [54]:
ventas_2020 = ventas['2020']

In [55]:
ventas_2020

                Trimestre 1  Trimestre 2  Trimestre 3  Trimestre 4
Sucursal Norte         1001         1002         1003         1004
Sucursal Este          2001         2002         2003         2004
Sucursal Oeste         3001         3002         3003         3004
Sucursal Sur           4001         4002         4003         4004

In [56]:
ventas_2021 = ventas['2021']

In [57]:
ventas_2021

                Trimestre 1  Trimestre 2  Trimestre 3  Trimestre 4
Sucursal Norte         2001         2002         2003         2004
Sucursal Este          4001         4002         4003         4004
Sucursal Oeste         6001         6002         6003         6004
Sucursal Sur           8001         8002         8003         8004

In [58]:
ventas = pd.read_excel('../files/datos/ventas_anuales.xlsx', index_col=0, skiprows=1,
                      sheet_name='2021')

In [59]:
ventas

                Trimestre 1  Trimestre 2  Trimestre 3  Trimestre 4
Sucursal Norte         2001         2002         2003         2004
Sucursal Este          4001         4002         4003         4004
Sucursal Oeste         6001         6002         6003         6004
Sucursal Sur           8001         8002         8003         8004